//---------------------------------------------------------------------------
// Meshobj.h
// Загрузка объекта из мешей    
//---------------------------------------------------------------------------
#include <d3d11.h>
#include <d3dx11.h>
//---------------------------------------------------------------------------
// Задаем максимальное количество вершин и индексов. Это значение
// можно увеличить если требуется загружать большие меши       
//---------------------------------------------------------------------------
const int buffermax=16384;
//---------------------------------------------------------------------------
// Базовый класс для загрузки и хранения мешей. Создайте несколько экземпляров
// данного класса для загрузки в ваше приложение нескольких мешей
//---------------------------------------------------------------------------
class MeshFromObj
{
	public:
	MeshFromObj(ID3D11Device * pd3dDevice, ID3D11DeviceContext* context, char * fname);
	void Draw();
	~MeshFromObj();

	protected:
	ID3D11Device*               c_pd3dDevice;
	ID3D11DeviceContext*		c_pImmediateContext;
	ID3D11Buffer*               c_pVertexBuffer;
	ID3D11Buffer*               c_pIndexBuffer;
	int						    verticesCount;
	int						    indicesCount;
	bool						meshloaded;
	void LoadMeshFromObj(char * fname);
	HRESULT CreateVertexAndIndexBuffers();
};
//---------------------------------------------------------------------------